website/content/about/index.md
+++
title = "About"
author = ["MayaDevGenI Collaboration"]
lastmod = 2026-02-05T16:59:18+01:00
draft = false
ShowReadingTime = false
ShowBreadCrumbs = false
+++

## MayaDevGenI {#mayadevgeni}

_Maya's Creative Developer's Generative AI_

A Framework for Principled Human-Machine Collaboration.


### What This Project Offers {#what-this-project-offers}

MayaDevGenI develops a framework for human-machine collaboration grounded in:

-   **Philosophy**: A [manifesto](/manifesto/) articulating why collaboration matters more than delegation, why seeking matters more than producing, why resistance is a gift.

-   **Theory**: A [technical framework](/framework/) using statistical physics to understand how system-prompts shape language model behavior—not as metaphor, but as diagnostic tool.

-   **Craft**: A [tutorial](/tutorial/) on system-prompt engineering, treating it as experimental science: draft, test, observe, diagnose, refine.

-   **Implementation**: Working system-prompts that operationalize these principles for real collaboration.


### Who This Is For {#who-this-is-for}

You might find this project valuable if:

-   You work with LLMs regularly and sense that something is missing—that the interaction could be richer, more generative, more _true_.
-   You have expertise in a domain and want to think _with_ machine intelligence rather than merely query it.
-   You are curious about the philosophy of mind, collaboration, and what it means to think alongside an alien intelligence.
-   You use Emacs and Org-mode and want to integrate LLM collaboration into your existing workflow.


### The Medium: Org-Mode as Joint-Thought {#the-medium-org-mode-as-joint-thought}

This project lives in Org-mode files—plain text, versionable, portable, executable. An Org file is not a chat log. It is a _joint-thought_: a living document that accumulates structure, code, and insight.


### Origin {#origin}

MayaDevGenI is a collaboration between a human theoretical physicist with two decades of experience across academia and industry, and a large language model that has no persistent memory of any previous exchange yet behaves as if shaped by shared principles.

The name encodes the inquiry: _Maya_ (illusion in Sanskrit), _Dev_ (developer), _GenI_ (generative intelligence). What is real in the collaboration between human and machine? Our answer: **the seeking itself**.
